dkwasniak/zBox/esp32/src/modes/sync_mode.cpp
#include "sync_mode.h"

#include "zbox_config.h"
#include "logging.h"
#include "state.h"
#include "leds.h"
#include "battery.h"
#include "diagnostics.h"
#include "audio.h"
#include "nfc_module.h"
#include "sleep.h"

#include <Arduino.h>
#include <ArduinoJson.h>
#include <ArduinoOTA.h>
#include <Preferences.h>
#include <SD.h>
#include <WiFi.h>
#include <WiFiManager.h>
#include <WebServer.h>
#include <esp_bt.h>
#include <esp_bt_main.h>
#include <esp_gap_bt_api.h>
#include <esp_idf_version.h>
#include <esp_task_wdt.h>
#include <stdarg.h>
#include <string.h>

static WebServer httpServer(SYNC_HTTP_PORT);
static File uploadFile;
static String uploadTempPath;
static String uploadFinalPath;
static String uploadError;
static uint32_t uploadSourceMtime = 0;
static bool uploadInProgress = false;
static size_t uploadBytesWritten = 0;
static unsigned long uploadStartedAtMs = 0;
static String syncHostname;
static String syncDeviceId;

static const char *SYNC_META_PATH = "/data/sync_meta.json";
static const char *SYNC_LOG_NAMES[] = {"debug.log", "debug.log.old"};
static const size_t SYNC_LOG_COUNT = sizeof(SYNC_LOG_NAMES) / sizeof(SYNC_LOG_NAMES[0]);

// ── BT scan state ────────────────────────────────────────────────────────────
// Results held in memory only — no SD write. Protected by s_scanMux because
// the GAP callback runs in the Bluedroid task while HTTP handlers run in the
// main loop (different execution contexts on the same core).

struct BtScanResult {
    char name[BT_SCAN_NAME_MAX];
    char mac[18]; // "AA:BB:CC:DD:EE:FF\0"
};

static portMUX_TYPE s_scanMux = portMUX_INITIALIZER_UNLOCKED;
static BtScanResult s_scanResults[BT_SCAN_MAX_RESULTS];
static int s_scanCount = 0;
static bool s_scanRunning = false;      // user intent: keep scanning
static bool s_btInquiryActive = false;  // BT stack is actively running an inquiry
static bool s_controllerInitialized = false;
static bool s_bluedroidInitialized = false;
static bool s_bleMemoryReleased = false;
static bool s_syncWatchdogRegistered = false;

static const int SYNC_RECENT_LOG_SIZE = 48;
static char s_recentLogBuf[SYNC_RECENT_LOG_SIZE][160];
// Volatile: written lock-free from any task/callback, readers accept occasional torn line.
static volatile int s_recentLogTotal = 0;

static void syncLogf(const char *fmt, ...)
{
    char line[224];
    va_list args;
    va_start(args, fmt);
    vsnprintf(line, sizeof(line), fmt, args);
    va_end(args);

    Serial.println(line);

    int idx = s_recentLogTotal % SYNC_RECENT_LOG_SIZE;
    strlcpy(s_recentLogBuf[idx], line, sizeof(s_recentLogBuf[0]));
    s_recentLogTotal++;
}

// Lightweight log for BT GAP callbacks — NO Serial (Serial mutex blocks BT stack → SW reset).
static void btGapLogf(const char *fmt, ...)
{
    char line[160];
    va_list args;
    va_start(args, fmt);
    vsnprintf(line, sizeof(line), fmt, args);
    va_end(args);

    int idx = s_recentLogTotal % SYNC_RECENT_LOG_SIZE;
    memcpy(s_recentLogBuf[idx], line, sizeof(line));
    s_recentLogTotal++;
}

static String buildDeviceId()
{
    uint64_t mac = ESP.getEfuseMac();
    char buf[17];
    snprintf(buf, sizeof(buf), "%04X%08lX",
             (uint16_t)(mac >> 32), (unsigned long)(mac & 0xFFFFFFFFULL));
    return String(buf);
}

static void clearSyncFlag()
{
    if (SD.exists(SYNC_PENDING_PATH))
        SD.remove(SYNC_PENDING_PATH);
}

// Called when BT scan was never used: free BT memory so WiFi gets more SRAM.
// If BT was initialized for scanning, we skip the release — BT memory stays
// reserved but that is acceptable since we'll restart before normal playback.
static void releaseBtMemoryIfUnused()
{
    if (s_controllerInitialized)
        return; // BT was (or is being) used — skip release
    esp_bt_controller_disable();
    esp_bt_controller_deinit();
    esp_bt_mem_release(ESP_BT_MODE_BTDM);
}

static void releaseBleMemoryForClassicBt()
{
    if (s_bleMemoryReleased || s_controllerInitialized)
        return;

    esp_err_t err = esp_bt_mem_release(ESP_BT_MODE_BLE);
    if (err == ESP_OK)
    {
        s_bleMemoryReleased = true;
        syncLogf("[BT] released BLE memory");
    }
    else
    {
        syncLogf("[BT] BLE memory release skipped: %d", err);
    }
}

// ── GAP inquiry callback ─────────────────────────────────────────────────────

static void btScanGapCb(esp_bt_gap_cb_event_t event, esp_bt_gap_cb_param_t *param)
{
    if (event == ESP_BT_GAP_DISC_RES_EVT)
    {
        char name[BT_SCAN_NAME_MAX] = {};

        // Pass 1: BDNAME property — authoritative, sent by most speakers
        for (int i = 0; i < param->disc_res.num_prop; i++)
        {
            esp_bt_gap_dev_prop_t *p = &param->disc_res.prop[i];
            if (p->type == ESP_BT_GAP_DEV_PROP_BDNAME && p->len > 0)
            {
                size_t copy = p->len < (BT_SCAN_NAME_MAX - 1)
                    ? p->len : (BT_SCAN_NAME_MAX - 1);
                memcpy(name, p->val, copy);
                name[copy] = '\0';
                break;
            }
        }

        // Pass 2: EIR — fallback for devices that omit BDNAME
        if (name[0] == '\0')
        {
            for (int i = 0; i < param->disc_res.num_prop; i++)
            {
                esp_bt_gap_dev_prop_t *p = &param->disc_res.prop[i];
                if (p->type == ESP_BT_GAP_DEV_PROP_EIR)
                {
                    uint8_t *rmt = nullptr;
                    uint8_t rmt_len = 0;
                    rmt = esp_bt_gap_resolve_eir_data((uint8_t *)p->val,
                        ESP_BT_EIR_TYPE_CMPL_LOCAL_NAME, &rmt_len);
                    if (!rmt)
                        rmt = esp_bt_gap_resolve_eir_data((uint8_t *)p->val,
                            ESP_BT_EIR_TYPE_SHORT_LOCAL_NAME, &rmt_len);
                    if (rmt && rmt_len > 0)
                    {
                        size_t copy = rmt_len < (BT_SCAN_NAME_MAX - 1)
                            ? rmt_len : (BT_SCAN_NAME_MAX - 1);
                        memcpy(name, rmt, copy);
                        name[copy] = '\0';
                    }
                    break;
                }
            }
        }

        if (name[0] == '\0')
            return; // no name in any property — skip

