dkwasniak/zBox/esp32/src/modes/sync_mode.cpp
        // Format MAC address
        const uint8_t *bda = param->disc_res.bda;
        char mac[18];
        snprintf(mac, sizeof(mac), "%02X:%02X:%02X:%02X:%02X:%02X",
                 bda[0], bda[1], bda[2], bda[3], bda[4], bda[5]);

        portENTER_CRITICAL_SAFE(&s_scanMux);
        // Dedup by MAC
        bool duplicate = false;
        for (int i = 0; i < s_scanCount; i++)
        {
            if (strncmp(s_scanResults[i].mac, mac, 17) == 0)
            {
                duplicate = true;
                break;
            }
        }
        if (!duplicate && s_scanCount < BT_SCAN_MAX_RESULTS)
        {
            strlcpy(s_scanResults[s_scanCount].name, name, sizeof(s_scanResults[0].name));
            strlcpy(s_scanResults[s_scanCount].mac,  mac,  sizeof(s_scanResults[0].mac));
            s_scanCount++;
            portEXIT_CRITICAL_SAFE(&s_scanMux);
            btGapLogf("[BT] found: %s %s", name, mac);
        }
        else
        {
            portEXIT_CRITICAL_SAFE(&s_scanMux);
        }
    }
    else if (event == ESP_BT_GAP_DISC_STATE_CHANGED_EVT)
    {
        if (param->disc_st_chg.state == ESP_BT_GAP_DISCOVERY_STOPPED)
        {
            btGapLogf("[BT] inquiry cycle done, found=%d total", s_scanCount);
            s_btInquiryActive = false;
            // Restart is handled by the main loop — calling esp_bt_gap_start_discovery
            // from within this callback causes a BT stack assertion / SW reset.
        }
    }
}

static bool initBtForScan()
{
    if (s_controllerInitialized)
        return true;

    releaseBleMemoryForClassicBt();

    syncLogf("[BT] initializing controller...");
    esp_bt_controller_config_t bt_cfg = BT_CONTROLLER_INIT_CONFIG_DEFAULT();
    if (esp_bt_controller_init(&bt_cfg) != ESP_OK)
    {
        syncLogf("[BT] controller init failed");
        return false;
    }
    esp_task_wdt_reset();
    s_controllerInitialized = true;

    if (esp_bt_controller_enable(ESP_BT_MODE_CLASSIC_BT) != ESP_OK)
    {
        syncLogf("[BT] controller enable failed");
        return false;
    }
    esp_task_wdt_reset();

    syncLogf("[BT] initializing bluedroid...");
    esp_bluedroid_config_t bd_cfg = BT_BLUEDROID_INIT_CONFIG_DEFAULT();
    if (esp_bluedroid_init_with_cfg(&bd_cfg) != ESP_OK)
    {
        syncLogf("[BT] bluedroid init failed");
        return false;
    }
    esp_task_wdt_reset();

    if (esp_bluedroid_enable() != ESP_OK)
    {
        syncLogf("[BT] bluedroid enable failed");
        return false;
    }
    esp_task_wdt_reset();
    s_bluedroidInitialized = true;

    esp_bt_gap_register_callback(btScanGapCb);
    syncLogf("[BT] ready for inquiry");
    return true;
}

static void configureSyncWatchdog()
{
#if ESP_IDF_VERSION_MAJOR >= 5
    esp_task_wdt_config_t wdt_cfg = {
        .timeout_ms = 15000,
        .idle_core_mask = 0,
        .trigger_panic = false
    };
    esp_task_wdt_reconfigure(&wdt_cfg);
#else
    esp_task_wdt_init(15, false);
#endif
    if (!s_syncWatchdogRegistered)
    {
        esp_err_t err = esp_task_wdt_add(NULL);
        if (err == ESP_OK)
            s_syncWatchdogRegistered = true;
        else
            syncLogf("[WDT] add failed: %d", err);
    }
}

static void disableSyncWatchdog()
{
    if (!s_syncWatchdogRegistered)
        return;

    esp_err_t err = esp_task_wdt_delete(NULL);
    if (err == ESP_OK)
        s_syncWatchdogRegistered = false;
    else
        syncLogf("[WDT] delete failed: %d", err);
}

static bool isPathSafe(const String &path)
{
    return path.startsWith("/") && path.indexOf("..") < 0 &&
           path.indexOf('\\') < 0 && path.indexOf("//") < 0;
}

static bool isManagedPath(const String &path)
{
    if (!isPathSafe(path))
        return false;
    return path == "/data/mappings.json" ||
           path == "/data/system_sounds.json" ||
           path == "/data/led_config.json" ||
           path.startsWith("/music/") ||
           path.startsWith("/data/system/");
}

static bool isUploadPath(const String &path)
{
    if (!isManagedPath(path))
        return false;
    return path.startsWith("/music/") || path.startsWith("/data/system/");
}

static bool isSyncLogName(const String &name)
{
    for (size_t i = 0; i < SYNC_LOG_COUNT; i++)
    {
        if (name == SYNC_LOG_NAMES[i])
            return true;
    }
    return false;
}

static String syncLogPath(const String &name)
{
    if (!isSyncLogName(name))
        return String();
    return "/data/" + name;
}

static void ensureDataDirs()
{
    if (!SD.exists("/music"))
        SD.mkdir("/music");
    if (!SD.exists("/data"))
        SD.mkdir("/data");
    if (!SD.exists("/data/system"))
        SD.mkdir("/data/system");
}

static void loadSyncMeta(JsonDocument &doc)
{
    doc.clear();
    File f = SD.open(SYNC_META_PATH, FILE_READ);
    if (!f)
        return;
    deserializeJson(doc, f);
    f.close();
    if (!doc.is<JsonObject>())
        doc.to<JsonObject>();
}

static void saveSyncMeta(JsonDocument &doc)
{
    if (SD.exists(SYNC_META_PATH))
        SD.remove(SYNC_META_PATH);
    File f = SD.open(SYNC_META_PATH, FILE_WRITE);
    if (!f)
        return;
    serializeJson(doc, f);
    f.close();
}

static uint64_t getTrackedMtime(const String &path, File &file)
{
    JsonDocument doc;
    loadSyncMeta(doc);
    JsonObject root = doc.as<JsonObject>();
    if (root[path].is<uint64_t>())
        return root[path].as<uint64_t>();
    return (uint64_t)file.getLastWrite();
}

static void setTrackedMtime(const String &path, uint32_t mtime)
{
    JsonDocument doc;
    loadSyncMeta(doc);
    JsonObject root = doc.as<JsonObject>();
    root[path] = mtime;
    saveSyncMeta(doc);
}

static void removeTrackedMtime(const String &path)
{
    JsonDocument doc;
    loadSyncMeta(doc);
    JsonObject root = doc.as<JsonObject>();
    root.remove(path);
    saveSyncMeta(doc);
}

static void sendSyncSnapshot()
{
    BatteryReading bat = readBatteryReading();
    esp_reset_reason_t reason = esp_reset_reason();
    syncLogf("[SYNC] uptime_ms=%lu reset=%d(%s) ip=%s rssi=%d",
             millis(), (int)reason, resetReasonName(reason),
             WiFi.localIP().toString().c_str(), WiFi.RSSI());
    syncLogf("[SYNC] battery adc_pin_v=%.3f battery_v=%.3f bars=%d color=%s charging_known=false",
             bat.adcPinVoltage, bat.batteryVoltage, bat.bars, bat.color);
    syncLogf("[SYNC] heap free=%u min=%u largest=%u sketch_free=%u",
             ESP.getFreeHeap(), ESP.getMinFreeHeap(), ESP.getMaxAllocHeap(), ESP.getFreeSketchSpace());
    syncLogf("[SYNC] hwm loop=%u led=%u audio=%u nfc=%u",
             uxTaskGetStackHighWaterMark(NULL), ledGetTaskHWM(), audioGetTaskHWM(), nfcGetTaskHWM());
}

static bool handleButtonExit()
{
    static bool armed = false;
    static unsigned long holdStart = 0;

    bool bothDown = digitalRead(BTN_A) == LOW && digitalRead(BTN_B) == LOW;
    if (!armed)
    {
        if (!bothDown)
            armed = true;
        return false;
    }

    if (!bothDown)
    {
        holdStart = 0;
        return false;
    }

    if (holdStart == 0)
        holdStart = millis();
    return millis() - holdStart >= LONG_PRESS_MS;
}

