dkwasniak/zBox/esp32/src/modes/sync_mode.cpp
static void handleWriteSystemSounds()
{
    if (rejectWhileUploadBusy("write-system-sounds"))
        return;
    if (!requireSdReady())
        return;

    String body = httpServer.arg("plain");
    if (body.isEmpty())
    {
        sendError(400, "missing body");
        return;
    }
    if (!writeJsonFile("/data/system_sounds.json", body))
    {
        sendError(400, "invalid system_sounds json");
        return;
    }
    JsonDocument doc;
    doc["saved"] = "/data/system_sounds.json";
    sendJson(200, doc);
}

static void handleGetLedConfig()
{
    if (rejectWhileUploadBusy("get-config"))
        return;
    if (!requireSdReady())
        return;
    httpServer.send(200, "application/json", ledGetConfigJson());
}

static void handleSaveLedConfig()
{
    if (rejectWhileUploadBusy("save-config"))
        return;
    if (!requireSdReady())
        return;

    String body = httpServer.arg("plain");
    if (body.isEmpty())
    {
        sendError(400, "missing body");
        return;
    }
    if (!ledSaveConfigJson(body))
    {
        sendError(400, "invalid led config");
        return;
    }
    JsonDocument doc;
    doc["saved"] = "/data/led_config.json";
    sendJson(200, doc);
}

static void handleDeleteFile()
{
    if (rejectWhileUploadBusy("delete-file"))
        return;
    if (!requireSdReady())
        return;

    String path = httpServer.arg("path");
    if (!isManagedPath(path))
    {
        sendError(400, "invalid path");
        return;
    }
    if (SD.exists(path) && !SD.remove(path))
    {
        sendError(500, "delete failed");
        return;
    }
    removeTrackedMtime(path);

    JsonDocument doc;
    doc["deleted"] = path;
    sendJson(200, doc);
}

static void handleRestart()
{
    if (rejectWhileUploadBusy("restart"))
        return;
    JsonDocument doc;
    doc["restart"] = true;
    sendJson(200, doc);
    delay(200);
    exitSyncMode("http restart");
}

static void appendSyncLogInfo(JsonArray logs, const char *name)
{
    String path = syncLogPath(name);
    if (!path.length())
        return;

    File f = SD.open(path, FILE_READ);
    if (!f || f.isDirectory())
    {
        if (f)
            f.close();
        return;
    }

    JsonObject obj = logs.add<JsonObject>();
    obj["name"] = name;
    obj["size"] = (uint64_t)f.size();
    obj["mtime"] = (uint64_t)f.getLastWrite();
    f.close();
}

static void handleLogs()
{
    if (rejectWhileUploadBusy("logs"))
        return;
    if (!requireSdReady())
        return;

    JsonDocument doc;
    JsonArray logs = doc["logs"].to<JsonArray>();
    for (size_t i = 0; i < SYNC_LOG_COUNT; i++)
        appendSyncLogInfo(logs, SYNC_LOG_NAMES[i]);
    sendJson(200, doc);
}

static void handleLogContent()
{
    if (rejectWhileUploadBusy("log-content"))
        return;
    if (!requireSdReady())
        return;

    String name = httpServer.arg("name");
    if (!isSyncLogName(name))
    {
        sendError(400, "invalid log name");
        return;
    }

    int tail = httpServer.arg("tail").toInt();
    if (tail <= 0)
        tail = 200;
    if (tail > 500)
        tail = 500;

    String path = syncLogPath(name);
    File f = SD.open(path, FILE_READ);
    if (!f || f.isDirectory())
    {
        if (f)
            f.close();
        sendError(404, "log not found");
        return;
    }

    String *ring = new String[tail];
    int totalLines = 0;
    while (f.available())
    {
        String line = f.readStringUntil('\n');
        while (line.endsWith("\n") || line.endsWith("\r"))
            line.remove(line.length() - 1);
        ring[totalLines % tail] = line;
        totalLines++;
    }
    f.close();

    int count = totalLines < tail ? totalLines : tail;
    int start = totalLines > tail ? (totalLines % tail) : 0;
    String text;
    for (int i = 0; i < count; i++)
    {
        const String &line = ring[(start + i) % tail];
        text += line;
        text += '\n';
    }
    delete[] ring;

    JsonDocument doc;
    doc["name"] = name;
    doc["text"] = text;
    doc["truncated"] = totalLines > tail;
    sendJson(200, doc);
}

static void handleLogDownload()
{
    if (rejectWhileUploadBusy("log-download"))
        return;
    if (!requireSdReady())
        return;

    String name = httpServer.arg("name");
    if (!isSyncLogName(name))
    {
        sendError(400, "invalid log name");
        return;
    }

    String path = syncLogPath(name);
    File f = SD.open(path, FILE_READ);
    if (!f || f.isDirectory())
    {
        if (f)
            f.close();
        sendError(404, "log not found");
        return;
    }

    httpServer.sendHeader("Content-Disposition", "attachment; filename=\"" + name + "\"");
    httpServer.streamFile(f, "text/plain; charset=utf-8");
    f.close();
}

static void handleUploadResult()
{
    if (!uploadError.isEmpty())
    {
        syncLogf("[SYNC] upload result error target=%s error=%s", uploadFinalPath.c_str(), uploadError.c_str());
        sendError(400, uploadError.c_str());
        uploadError = "";
        uploadInProgress = false;
        return;
    }

    syncLogf("[SYNC] upload result ok target=%s bytes=%u elapsed_ms=%lu",
             uploadFinalPath.c_str(),
             (unsigned int)uploadBytesWritten,
             millis() - uploadStartedAtMs);
    JsonDocument doc;
    doc["uploaded"] = uploadFinalPath;
    sendJson(200, doc);
    uploadInProgress = false;
}

static void handleUploadStream()
{
    HTTPUpload &upload = httpServer.upload();

    if (upload.status == UPLOAD_FILE_START)
    {
        esp_task_wdt_reset();
        uploadInProgress = true;
        uploadError = "";
        uploadTempPath = "";
        uploadFinalPath = "";
        uploadSourceMtime = 0;
        uploadBytesWritten = 0;
        uploadStartedAtMs = millis();
        uploadFile = File();

        if (!sdReady)
        {
            uploadError = "sd not ready";
            return;
        }

        uploadFinalPath = httpServer.arg("path");
        if (!isUploadPath(uploadFinalPath))
        {
            uploadError = "invalid upload path";
            return;
        }
        uploadSourceMtime = (uint32_t)httpServer.arg("mtime").toInt();
        syncLogf("[SYNC] upload start target=%s mtime=%u", uploadFinalPath.c_str(), (unsigned int)uploadSourceMtime);

