dkwasniak/zBox/esp32/src/modes/sync_mode.cpp
        uploadTempPath = uploadFinalPath + ".tmp";
        if (SD.exists(uploadTempPath))
            SD.remove(uploadTempPath);
        uploadFile = SD.open(uploadTempPath, FILE_WRITE);
        if (!uploadFile)
            uploadError = "cannot open temp file";
    }
    else if (upload.status == UPLOAD_FILE_WRITE)
    {
        if (uploadError.isEmpty() && uploadFile)
        {
            esp_task_wdt_reset();
            if (uploadFile.write(upload.buf, upload.currentSize) != upload.currentSize)
                uploadError = "write failed";
            else
                uploadBytesWritten += upload.currentSize;
        }
    }
    else if (upload.status == UPLOAD_FILE_END)
    {
        esp_task_wdt_reset();
        if (uploadFile)
            uploadFile.close();
        if (uploadError.isEmpty())
        {
            if (SD.exists(uploadFinalPath))
                SD.remove(uploadFinalPath);
            if (!SD.rename(uploadTempPath, uploadFinalPath))
            {
                SD.remove(uploadTempPath);
                uploadError = "rename failed";
            }
            else if (uploadSourceMtime > 0)
            {
                setTrackedMtime(uploadFinalPath, uploadSourceMtime);
            }
            syncLogf("[SYNC] upload end target=%s bytes=%u elapsed_ms=%lu",
                     uploadFinalPath.c_str(),
                     (unsigned int)uploadBytesWritten,
                     millis() - uploadStartedAtMs);
        }
        else if (uploadTempPath.length())
        {
            SD.remove(uploadTempPath);
            syncLogf("[SYNC] upload failed target=%s error=%s bytes=%u",
                     uploadFinalPath.c_str(),
                     uploadError.c_str(),
                     (unsigned int)uploadBytesWritten);
        }
        uploadFile = File();
        uploadInProgress = false;
    }
    else if (upload.status == UPLOAD_FILE_ABORTED)
    {
        esp_task_wdt_reset();
        if (uploadFile)
            uploadFile.close();
        if (uploadTempPath.length())
            SD.remove(uploadTempPath);
        uploadError = "upload aborted";
        syncLogf("[SYNC] upload aborted target=%s bytes=%u elapsed_ms=%lu",
                 uploadFinalPath.c_str(),
                 (unsigned int)uploadBytesWritten,
                 millis() - uploadStartedAtMs);
        uploadFile = File();
        uploadInProgress = false;
    }
}

static void handleBtStartScan()
{
    if (s_scanRunning)
    {
        // Already scanning — return current state instead of starting a second inquiry
        // (double-calling esp_bt_gap_start_discovery while running crashes the BT stack)
        JsonDocument doc;
        doc["scanning"] = true;
        sendJson(200, doc);
        return;
    }

    if (!initBtForScan())
    {
        sendError(500, "bt init failed");
        return;
    }

    portENTER_CRITICAL_SAFE(&s_scanMux);
    s_scanCount = 0;
    portEXIT_CRITICAL_SAFE(&s_scanMux);

    // 30-second inquiry; portal polls /bt/devices and can stop early via /bt/stop-scan
    esp_err_t err = esp_bt_gap_start_discovery(ESP_BT_INQ_MODE_GENERAL_INQUIRY, 30, 0);
    if (err != ESP_OK)
    {
        syncLogf("[BT] start_discovery failed: %d", err);
        sendError(500, "discovery start failed");
        return;
    }
    s_scanRunning = true;
    s_btInquiryActive = true;
    syncLogf("[BT] inquiry started (30s)");

    JsonDocument doc;
    doc["scanning"] = true;
    sendJson(200, doc);
}

static void handleBtStopScan()
{
    if (s_scanRunning)
    {
        esp_bt_gap_cancel_discovery();
        s_scanRunning = false;
        s_btInquiryActive = false;
    }

    portENTER_CRITICAL_SAFE(&s_scanMux);
    int count = s_scanCount;
    portEXIT_CRITICAL_SAFE(&s_scanMux);

    JsonDocument doc;
    doc["scanning"] = false;
    doc["count"]    = count;
    sendJson(200, doc);
}

static void handleBtDevices()
{
    // Copy results under lock, then build JSON outside the critical section
    BtScanResult local[BT_SCAN_MAX_RESULTS];
    int count = 0;

    portENTER_CRITICAL_SAFE(&s_scanMux);
    count = s_scanCount;
    if (count > 0)
        memcpy(local, s_scanResults, count * sizeof(BtScanResult));
    portEXIT_CRITICAL_SAFE(&s_scanMux);

    JsonDocument doc;
    doc["scanning"] = s_scanRunning;
    JsonArray arr = doc["devices"].to<JsonArray>();
    for (int i = 0; i < count; i++)
    {
        JsonObject obj = arr.add<JsonObject>();
        obj["name"] = local[i].name;
        obj["mac"]  = local[i].mac;
    }
    sendJson(200, doc);
}

static void handleBtSelect()
{
    String body = httpServer.arg("plain");
    if (body.isEmpty())
    {
        sendError(400, "missing body");
        return;
    }

    JsonDocument doc;
    if (deserializeJson(doc, body) != DeserializationError::Ok)
    {
        sendError(400, "invalid json");
        return;
    }

    const char *name = doc["name"] | "";
    size_t nameLen = strlen(name);
    if (nameLen == 0 || nameLen > 63)
    {
        sendError(400, "invalid name");
        return;
    }

    if (s_scanRunning)
    {
        esp_bt_gap_cancel_discovery();
        s_scanRunning = false;
    }

    Preferences prefs;
    prefs.begin("zbox", false);
    prefs.putString(BT_TARGET_NVS_KEY, name);
    prefs.end();
    syncLogf("[BT] target saved: %s", name);

    JsonDocument resp;
    resp["saved"] = true;
    resp["name"]  = name;
    sendJson(200, resp);
}

static void handleRecentLog()
{
    int since = httpServer.arg("since").toInt();
    if (since < 0) since = 0;

    int total = s_recentLogTotal;  // single volatile read — consistent snapshot
    int stored = total < SYNC_RECENT_LOG_SIZE ? total : SYNC_RECENT_LOG_SIZE;
    int oldestTotal = total - stored;
    int from = since < oldestTotal ? oldestTotal : since;

    JsonDocument doc;
    doc["total"] = total;
    JsonArray arr = doc["lines"].to<JsonArray>();
    for (int i = from; i < total; i++)
        arr.add((const char *)s_recentLogBuf[i % SYNC_RECENT_LOG_SIZE]);
    sendJson(200, doc);
}

static void handleNotFound()
{
    sendError(404, "not found");
}

static void setupHttpRoutes()
{
    httpServer.on("/diag/status", HTTP_GET, handleStatus);
    httpServer.on("/diag/files", HTTP_GET, handleFiles);
    httpServer.on("/diag/upload", HTTP_POST, handleUploadResult, handleUploadStream);
    httpServer.on("/diag/file", HTTP_DELETE, handleDeleteFile);
    httpServer.on("/diag/logs", HTTP_GET, handleLogs);
    httpServer.on("/diag/log-content", HTTP_GET, handleLogContent);
    httpServer.on("/diag/log-download", HTTP_GET, handleLogDownload);
    httpServer.on("/diag/write-mappings", HTTP_POST, handleWriteMappings);
    httpServer.on("/diag/write-system-sounds", HTTP_POST, handleWriteSystemSounds);
    httpServer.on("/diag/config", HTTP_GET, handleGetLedConfig);
    httpServer.on("/diag/config", HTTP_POST, handleSaveLedConfig);
    httpServer.on("/diag/restart", HTTP_POST, handleRestart);
    httpServer.on("/bt/start-scan", HTTP_POST, handleBtStartScan);
    httpServer.on("/bt/stop-scan",  HTTP_POST, handleBtStopScan);
    httpServer.on("/bt/devices",    HTTP_GET,  handleBtDevices);
    httpServer.on("/bt/select",     HTTP_POST, handleBtSelect);
    httpServer.on("/diag/recent-log", HTTP_GET, handleRecentLog);
    httpServer.onNotFound(handleNotFound);
    httpServer.begin();
}

